#+TITLE: PSEUDOCODE and IF/ELSE
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++ (Spring 2025)
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil ^:nil num:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :exports both :results output :noweb yes :tangle yes
** Solution

Code: [[https://onecompiler.com/c/43bc89w2e][In OneCompiler]]
#+name: pseudogold
#+begin_src C :cmdline < input
  // pseudogold.c: "Allow a player to deposit or withdraw gold from a
  // game bank account."
  // Input: choice (1=deposit,2=withdrawal, amount (integer)
  // Output: Deposited/withdrawn amount, new balance
  // Author: Marcus Birkenkrahe GNU GPLv3
  // Date: 03/11/2025

  #include <stdio.h>

  int main() {
    // variables
    int gold = 100; // Example: starting gold amount
    int choice;     // To store the player's choice (1 for deposit, 2 for withdraw)
    int amount;     // Amount to deposit or withdraw

    // Print balance and ask for action
    printf("Your gold: %d\n", gold);
    printf("Choose an action (1 to deposit, 2 to withdraw):\n");
    // Get action (print confirmation)
    scanf("%d", &choice);
    printf("Your choice: %d\n", choice);
    // Get amount (print confirmation)
    printf("Enter amount:\n");
    scanf("%d", &amount);
    printf("Your amount: %d\n", amount);

    // If (deposit chosen)
    if (choice == 1) {
      // add gold to the account
      gold = gold + amount;
      printf("Deposited %d gold. New balance: %d\n", amount, gold);
    } else {   // Else if (withdrawal chosen)
      // subtract gold from the account
      gold = gold - amount;
      printf("Withdrew %d gold. New balance: %d\n", amount, gold);
    }

    return 0;
  }
#+end_src

#+RESULTS:
: Your gold: 100
: Choose an action (1 to deposit, 2 to withdraw):
: Your choice: 2
: Enter amount:
: Your amount: 100
: Withdrew 100 gold. New balance: 0

** Sample solution:

[[https://onecompiler.com/c/43bj58v5n][OneCompiler link]]

#+begin_src C :main no :includes
  #include <stdio.h>
  #include <stdlib.h>

  int main(void)
  {
    // Problem: "Allow a player to buy a sword from a shop if they have
    // enough gold (50 gold or more), or sell a sword if they don’t have
    // enough."

    // Start with 40 gold
    int gold = 40;
    // Set the sword price to 50 gold
    int sword_price = 50;
    // If the player has enough gold (>= 50), subtract 50 gold and print
    // "Sword bought".  If not, add 20 gold (selling a sword and print
    // "Sword sold".
    if (gold >= 50) {
      gold = gold - 50;
      puts("Sword bought");
    } else {
      gold = gold - 20;
      puts("Sword sold");
    }
    return EXIT_SUCCESS;
  }
#+end_src

#+RESULTS:
: Sword sold

* Input

Input for [[pseudogold]]
#+begin_src bash :results output :exports both
  echo "2" > input # action (1 = deposit, 2 = withdraw)
  echo "100" >> input # amount of gold
  cat input
#+end_src

#+RESULTS:
: 2
: 100

Input for [[pseudogold2]]
#+begin_src bash :results output :exports both
  echo "2" > input # action (1 = deposit, 2 = withdraw)
  echo "200" >> input # amount of gold
  cat input
#+end_src

#+RESULTS:
: 2
: 200

Input for [[pseudogold3]]
#+begin_src bash :results output :exports both
  echo "2" > input # action (1 = deposit, 2 = withdraw)
  echo "200" >> input # amount of gold
  cat input
#+end_src

#+RESULTS:
: 2
: 200

